spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
/**
 * @file lora_rak3172.cpp
 * @brief LoRa RAK3172-SiP device driver — state machine, TX, join, config.
 */

#include "lora_rak3172.hpp"
#include "lora_rak3172_comm.hpp"
#include "bsp.hpp"
#include "gpio.hpp"
#include "pmu.hpp"
#include "debug.hpp"
#include "error.hpp"
#include "binascii.hpp"
#include "config_store.hpp"
#include "nrf_gpio.h"
#include <cstdint>
#include <string>

// Park unused satellite-slot pins in high-impedance on the LoRa board variant:
//   - SAT_INT (P0.29): BSP default has INPUT_CONNECT (input buffer ON). On the
//     LoRa PCB this pin is not wired to anything the RAK3172 drives, so the
//     enabled buffer floats and leaks through the Schmitt trigger. Switch to
//     INPUT_DISCONNECT.
//   - SAT_EXTWAKEUP (P0.30): not connected on LoRa. BSP leaves it as an output;
//     driving an unconnected pin is 0 A but toggling during state changes is
//     wasted bus activity. Park as INPUT_DISCONNECT.
//   - SAT_RESET (P0.31): BSP already sets INPUT_DISCONNECT for probe flashing,
//     which coincidentally is also the lowest-leakage config — leave as is.
//   - SAT_PWR_EN (P1.15): THE one pin we keep actively driving (module power).
static inline void lora_park_unused_sat_pins()
{
    nrf_gpio_cfg(NRF_GPIO_PIN_MAP(0, 29),   // SAT_INT
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_DISCONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);
    nrf_gpio_cfg(NRF_GPIO_PIN_MAP(0, 30),   // SAT_EXTWAKEUP
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_DISCONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);
}

using namespace LoRa;

#define LORA_STATE_CHANGE(x, y)                                 \
    do {                                                        \
        DEBUG_TRACE("LoRa::STATE_CHANGE: " #x " -> " #y);      \
        m_state = State::y;                                     \
        state_ ## x ##_exit();                                  \
        state_ ## y ##_enter();                                 \
        run_state_machine();                                    \
    } while (0)

#define LORA_STATE_EQUAL(x) \
    (m_state == State::x)

#define LORA_STATE_CALL(x) \
    do {                   \
        state_ ## x();     \
    } while (0)

extern Scheduler *system_scheduler;
extern ConfigurationStore *configuration_store;

LoRaDevice::LoRaDevice()
{
    m_packet_buffer.clear();
    m_state = State::power_off;
    m_joined = false;
    m_join_failed = false;
    m_tx_done = false;
    m_config_step = 0;
    m_is_configured = false;
    m_power_on_retry = 0;
    m_nwm_reboot_pending = false;
    m_consecutive_errors = 0;
    load_config_from_store();
    LORA_STATE_CHANGE(power_off, power_on);
}

LoRaDevice::~LoRaDevice()
{
    stop_bridge();
    power_off_immediate();
}

bool LoRaDevice::start_bridge(LoRaComm::PassthroughCallback rx_callback)
{
    if (m_bridge_active)
        return true;

    // Cancel any pending state machine task
    cancel_timeout();
    system_scheduler->cancel_task(m_task);

    // Ensure UART is initialized
    m_lora_comm.init();

    // Enable passthrough: raw UART RX goes to callback
    m_lora_comm.set_passthrough(true, rx_callback);
    m_bridge_active = true;

    DEBUG_INFO("LoRaDevice: bridge mode ACTIVE");
    return true;
}

void LoRaDevice::stop_bridge()
{
    if (!m_bridge_active)
        return;

    m_lora_comm.set_passthrough(false);
    m_bridge_active = false;

    DEBUG_INFO("LoRaDevice: bridge mode STOPPED");

    // Restart state machine from current state
    run_state_machine();
}

bool LoRaDevice::bridge_send(const uint8_t* data, size_t len)
{
    if (!m_bridge_active)
        return false;
    return m_lora_comm.send_raw_data(data, len);
}

void LoRaDevice::bridge_process_rx()
{
    if (m_bridge_active)
        m_lora_comm.process_rx();
}

/**
 * Send a packet via LoRaWAN.
 *
 * The modulation parameter is ignored (LoRa uses its own DR settings).
 * The packet data is hex-encoded and sent on the configured FPort.
 */
void LoRaDevice::send(const KineisModulation mode, const KineisPacket& user_payload, const unsigned int payload_length)
{
    (void)mode;  // LoRa handles modulation via DR setting

    // Reject if already transmitting to avoid overwriting in-flight packet
    if (m_state == State::transmit) {
        DEBUG_WARN("LoRaDevice::send: already transmitting, ignoring");
        return;
    }

    // Defense in depth: reject oversized payloads before handing to the module.
    // Service layer should already clamp to LoRaPayloadLimits::max_payload_for_dr,
    // but a stale config cache or programming error must not be able to wedge the
    // module with an AT_PARAM_ERROR that falls through the error retry path.
    unsigned int payload_bytes = (payload_length + 7) / 8;
    static constexpr unsigned int dr_limits[] = { 51, 51, 51, 115, 222, 222 };
    unsigned int max_bytes = (m_config.dr < 6) ? dr_limits[m_config.dr] : dr_limits[0];
    if (payload_bytes > max_bytes) {
        DEBUG_ERROR("LoRaDevice::send: payload %u bytes > DR%u limit %u — rejecting",
                    payload_bytes, m_config.dr, max_bytes);
        notify(KineisEventDeviceError({}));
        return;
    }

    KineisPacket packet(user_payload.begin(), user_payload.begin() + payload_bytes);
    m_packet_buffer = Binascii::hexlify(packet);

    DEBUG_TRACE("LoRaDevice::send: payload[%u bits]=%s", payload_length, m_packet_buffer.c_str());

    // Request power on (if not already running)
    start_device();
}

void LoRaDevice::stop_send() {
    DEBUG_TRACE("LoRaDevice::stop_send");
    m_packet_buffer.clear();
}

// ========================================================================
// Event handlers from LoRaComm
// ========================================================================

void LoRaDevice::react(const LoRaCommEventRespOk&) {
    m_cmd_is_ok = true;
}

void LoRaDevice::react(const LoRaCommEventRespError& err) {
    DEBUG_INFO("LoRaDevice: error response type=%d", static_cast<int>(err.error_type));
    m_is_error = true;
}

void LoRaDevice::react(const LoRaCommEventJoined&) {
    DEBUG_INFO("LoRaDevice: JOINED");
    m_joined = true;
}

void LoRaDevice::react(const LoRaCommEventJoinFailed&) {
    DEBUG_INFO("LoRaDevice: JOIN FAILED");
    m_join_failed = true;
}

void LoRaDevice::react(const LoRaCommEventTxDone&) {
    DEBUG_TRACE("LoRaDevice: TX_DONE");
    m_tx_done = true;
}

void LoRaDevice::react(const LoRaCommEventRxData& rx) {
    DEBUG_INFO("LoRaDevice: RX port=%d data=%s", rx.port, rx.payload.c_str());
    // Downlink data received - could be forwarded to a service if needed
}

void LoRaDevice::react(const LoRaCommEventUartError& err) {
    DEBUG_INFO("LoRaDevice: UART error type=%02x", err.error_type);
    m_is_error = true;
}

// ========================================================================
// Timeout management
// ========================================================================

void LoRaDevice::initiate_timeout(unsigned int timeout_ms) {
    cancel_timeout();
    m_timeout.handle = system_scheduler->post_task_prio([this]() {
        on_timeout();
    }, "LoRaTimeout", Scheduler::DEFAULT_PRIORITY, timeout_ms);
}

