spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
void LoRaDevice::on_timeout() {
    DEBUG_ERROR("LoRaDevice::on_timeout");
    m_is_error = true;
}

void LoRaDevice::cancel_timeout() {
    system_scheduler->cancel_task(m_timeout.handle);
}

// ========================================================================
// State machine infrastructure
// ========================================================================

void LoRaDevice::start_device()
{
    if (m_state == State::standby) {
        // state_standby_enter deinit'd the nRF UARTE1 for power savings. We
        // MUST reinit it before any AT command — sending on a deinit'd UART
        // silently fails (nrf_libuarte_async_tx no-ops) and leaves
        // m_is_send_busy stuck at true, producing "already busy" on every
        // subsequent call. init() is idempotent (guarded by m_is_init).
        m_lora_comm.init();

        // Quick wake from LPM Stop2 via AT ping (~10ms).
        // RAK3172 wakes on first UART byte, responds to AT within a few ms.
        // Retry up to 3 times before power cycling (module may be slow to wake).
        bool wake_ok = false;
        for (int attempt = 0; attempt < 3 && !wake_ok; attempt++) {
            if (send_AT(AT_TEST))
                wake_ok = true;
        }
        if (wake_ok) {
            DEBUG_TRACE("LoRa: wake from standby OK");
            LORA_STATE_CHANGE(standby, idle);
        } else {
            // Module not responding after 3 attempts — full power cycle
            DEBUG_WARN("LoRa: standby wake failed after 3 attempts, power cycling");
            std::string saved_packet = m_packet_buffer;
            power_off_immediate();  // This clears m_packet_buffer
            m_packet_buffer = saved_packet;
            LORA_STATE_CHANGE(power_off, power_on);
        }
        return;
    }

    if (m_state != State::power_off) {
        DEBUG_TRACE("LoRa::start: already running state=%u", static_cast<unsigned>(m_state));
        run_state_machine(0);
        return;
    }
    LORA_STATE_CHANGE(power_off, power_on);
}

void LoRaDevice::power_off_immediate(void)
{
    DEBUG_TRACE("LoRaDevice::power_off_immediate");
    if (!LORA_STATE_EQUAL(power_off)) {
        system_scheduler->cancel_task(m_task);
        cancel_timeout();
        m_state = State::power_off;
        state_power_off_enter();
    }
}

/// @brief Warm up the module for a fast next-TX dispatch. The FSM runs
/// power_on → configure → join → idle → standby asynchronously. State
/// machine is left in standby with empty packet buffer so the next send()
/// goes through the fast wake path (state_standby → start_device reinit
/// UART + AT ping ~10 ms).
void LoRaDevice::warm_up_for_tx()
{
    if (m_state != State::power_off) {
        // Already running — nothing to do. start_device would just log and
        // re-tick the FSM.
        return;
    }
    DEBUG_INFO("LoRaDevice::warm_up_for_tx: pre-booting module for next surface TX");
    LORA_STATE_CHANGE(power_off, power_on);
}

/// @brief Blocking send of an AT command with polling for OK response.
/// @param cmd        AT command type.
/// @param params     Optional parameter string.
/// @param timeout_ms Maximum wait time in ms.
/// @return true on success (OK received), false on error/timeout.
bool LoRaDevice::send_AT(ATCmd cmd, const std::optional<std::string>& params, uint16_t timeout_ms)
{
    m_cmd_is_ok = false;
    m_is_error = false;

    m_lora_comm.send(cmd, params);

    while (!m_cmd_is_ok && !m_is_error && timeout_ms != 0) {
        PMU::delay_ms(1);
        m_lora_comm.process_rx();
        timeout_ms--;
    }

    if (timeout_ms == 0)
        DEBUG_WARN("LoRaDevice::send_AT: timeout (cmd=%d)", static_cast<int>(cmd));

    return m_cmd_is_ok && !m_is_error;
}

void LoRaDevice::state_machine(void)
{
    switch (m_state) {
    case State::power_off:   LORA_STATE_CALL(power_off);  break;
    case State::power_on:    LORA_STATE_CALL(power_on);   break;
    case State::configure:   LORA_STATE_CALL(configure);  break;
    case State::joining:     LORA_STATE_CALL(joining);    break;
    case State::idle:        LORA_STATE_CALL(idle);       break;
    case State::standby:     LORA_STATE_CALL(standby);    break;
    case State::transmit:    LORA_STATE_CALL(transmit);   break;
    case State::error:       LORA_STATE_CALL(error);      break;
    default: break;
    }
}

void LoRaDevice::run_state_machine(uint16_t delay_ms)
{
    system_scheduler->cancel_task(m_task);
    m_task = system_scheduler->post_task_prio([this]() {
        state_machine();
    }, "LoRaStateMachine", Scheduler::DEFAULT_PRIORITY, delay_ms);
}

// ========================================================================
// State: power_off
// ========================================================================

void LoRaDevice::state_power_off_enter()
{
    DEBUG_INFO("LoRaDevice::state_power_off_enter");
    m_lora_comm.deinit();
    GPIOPins::clear(SAT_PWR_EN);
    // Park all non-essential nRF pins that touch (or might touch) the LoRa
    // slot into high-impedance input-disconnect so the board truly draws 0 A
    // through the satellite interface when SAT_PWR_EN is low.
    lora_park_unused_sat_pins();
    m_packet_buffer.clear();
}

void LoRaDevice::state_power_off() {
    ;
}

void LoRaDevice::state_power_off_exit() {
    ;
}

// ========================================================================
// State: power_on
//   - Enable power to module
//   - Init UART at 115200 baud
//   - Wait for module boot
//   - Verify communication with AT ping
// ========================================================================

void LoRaDevice::state_power_on_enter()
{
    GPIOPins::set(SAT_PWR_EN);
    // Park unused SAT_* slot pins in input-disconnect. Runs on every power-on
    // so first-boot (before any power_off_enter has fired) still gets the
    // low-leakage pin config instead of the BSP default (input buffer ON).
    lora_park_unused_sat_pins();
    m_lora_comm.init();  // RAK3172 RUI3 factory default 115200 8N1
    m_lora_comm.subscribe(*this);
    m_joined = false;
    m_join_failed = false;
    m_power_on_retry = 0;
    // Non-blocking: schedule first state_power_on() after module boot delay
}

