spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
void LoRaDevice::state_power_on()
{
    if (m_power_on_retry == 0) {
        // First call: wait for RAK3172 boot (typically ~1.5s)
        m_power_on_retry = 1;
        run_state_machine(2000);  // Non-blocking 2s boot wait
        return;
    }

    // Drain boot banner / noise before the first AT ping. The RAK3172 prints a
    // welcome banner at power-on which would otherwise trigger a spurious
    // framing error and confuse the next send_AT's polling loop.
    if (m_power_on_retry == 1)
        m_lora_comm.process_rx();

    DEBUG_INFO("LoRaDevice::state_power_on retry=%u", m_power_on_retry);

    // Try AT ping
    if (send_AT(AT_TEST))
    {
        DEBUG_TRACE("LoRaDevice: AT ping OK (attempt %u)", m_power_on_retry);
        LORA_STATE_CHANGE(power_on, configure);
        return;
    }

    if (m_power_on_retry < 4) {
        m_power_on_retry++;
        run_state_machine(500);  // Non-blocking 500ms retry delay
        return;
    }

    DEBUG_ERROR("LoRaDevice: AT ping failed after %u attempts — check wiring/module", m_power_on_retry);
    LORA_STATE_CHANGE(power_on, error);
}

void LoRaDevice::state_power_on_exit() {
    ;
}

// ========================================================================
// State: configure
//   - First boot: full configuration (all LoRaWAN parameters via AT commands)
//   - Subsequent boots: fast path — RAK3172 persists config to flash,
//     so we only read DEVEUI and check join status
// ========================================================================

void LoRaDevice::state_configure_enter()
{
    m_nwm_reboot_pending = false;
    if (m_is_configured) {
        // Fast path: RAK3172 persists config to flash, skip to DEVEUI read + join check
        m_config_step = 100;
        DEBUG_INFO("LoRaDevice: fast config (module already configured)");
    } else {
        m_config_step = 0;
        DEBUG_INFO("LoRaDevice: full config (first boot)");
    }
}

void LoRaDevice::state_configure()
{
    DEBUG_TRACE("LoRaDevice::state_configure step=%u", m_config_step);
    bool at_error = false;

    switch (m_config_step)
    {
        // ==== Full configuration (first boot only) ====

        case 0:
        {
            // Ensure LoRaWAN network mode (AT+NWM=1)
            if (m_nwm_reboot_pending) {
                m_nwm_reboot_pending = false;
                at_error = !send_AT(AT_TEST);
                if (at_error) {
                    DEBUG_ERROR("LoRaDevice: module not responding after NWM reboot");
                }
                break;
            }
            at_error = !send_AT(AT_GET_NWM);
            if (!at_error && m_lora_comm.m_last_value == "1") {
                DEBUG_TRACE("LoRaDevice: already in LoRaWAN mode");
                break;
            }
            DEBUG_INFO("LoRaDevice: setting NWM=1 (module will reboot)");
            if (!m_lora_comm.send(AT_SET_NWM, "1")) {
                DEBUG_ERROR("LoRaDevice: failed to issue AT+NWM=1 (UART busy/deinit)");
                at_error = true;
                break;
            }
            m_nwm_reboot_pending = true;
            run_state_machine(3000);  // Wait for module autoreboot after NWM change
            return;
        }

        case 1:
            // Set join mode (OTAA or ABP)
            at_error = !send_AT(AT_SET_NJM, std::to_string(m_config.njm));
            break;

        case 2:
            // Set frequency band
            at_error = !send_AT(AT_SET_BAND, std::to_string(m_config.band));
            break;

        case 3:
            // Set Device EUI. Only relevant for OTAA — ABP activation uses
            // DEVADDR + NWKSKEY + APPSKEY (written at step 5). RAK3172 rejects
            // AT+DEVEUI writes in certain ABP states with PARAM_ERROR type=2.
            if (m_config.njm == 0) {
                DEBUG_TRACE("LoRaDevice: ABP mode — skipping DEVEUI set");
                break;
            }
            if (m_config.deveui.empty()) {
                at_error = !send_AT(AT_GET_DEVEUI);
                if (!at_error && !m_lora_comm.m_last_value.empty() &&
                    m_lora_comm.m_last_value != "0000000000000000") {
                    m_config.deveui = m_lora_comm.m_last_value;
                    DEBUG_INFO("LoRaDevice: module DEVEUI=%s", m_config.deveui.c_str());
                } else {
                    // Generate from nRF52840 FICR unique device ID
                    char buf[17];
#ifdef NRF52840_XXAA
                    snprintf(buf, sizeof(buf), "%08lX%08lX",
                             (unsigned long)NRF_FICR->DEVICEID[1],
                             (unsigned long)NRF_FICR->DEVICEID[0]);
#else
                    snprintf(buf, sizeof(buf), "%08lX%08lX",
                             (unsigned long)0, (unsigned long)PMU::device_identifier());
#endif
                    m_config.deveui = std::string(buf);
                    DEBUG_INFO("LoRaDevice: generated DEVEUI=%s", m_config.deveui.c_str());
                    at_error = !send_AT(AT_SET_DEVEUI, m_config.deveui);
                }
                // Persist to config store so user can read via PARMR (LRP01)
                configuration_store->write_param(ParamID::LORA_DEVEUI, m_config.deveui);
            } else {
                at_error = !send_AT(AT_SET_DEVEUI, m_config.deveui);
            }
            break;

        case 4:
            // Set Application EUI (OTAA only)
            if (m_config.njm == 1 && !m_config.appeui.empty()) {
                if (m_config.appeui.size() != 16) {
                    DEBUG_ERROR("LoRaDevice: invalid APPEUI length %u (expected 16 hex chars)", static_cast<unsigned>(m_config.appeui.size()));
                    at_error = true;
                    break;
                }
                at_error = !send_AT(AT_SET_APPEUI, m_config.appeui);
            }
            break;

        case 5:
            // Set Application Key (OTAA) or session keys (ABP)
            if (m_config.njm == 1 && !m_config.appkey.empty()) {
                if (m_config.appkey.size() != 32) {
                    DEBUG_ERROR("LoRaDevice: invalid APPKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.appkey.size()));
                    at_error = true;
                    break;
                }
                at_error = !send_AT(AT_SET_APPKEY, m_config.appkey);
            } else if (m_config.njm == 0) {
                if (!m_config.devaddr.empty()) {
                    if (m_config.devaddr.size() != 8) {
                        DEBUG_ERROR("LoRaDevice: invalid DEVADDR length %u (expected 8 hex chars)", static_cast<unsigned>(m_config.devaddr.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_DEVADDR, m_config.devaddr);
                }
                if (!at_error && !m_config.nwkskey.empty()) {
                    if (m_config.nwkskey.size() != 32) {
                        DEBUG_ERROR("LoRaDevice: invalid NWKSKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.nwkskey.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_NWKSKEY, m_config.nwkskey);
                }
                if (!at_error && !m_config.appskey.empty()) {
                    if (m_config.appskey.size() != 32) {
                        DEBUG_ERROR("LoRaDevice: invalid APPSKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.appskey.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_APPSKEY, m_config.appskey);
                }
            }
            break;

