spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
        case 6:
            // Set device class (AT+CLASS=A/B/C)
            at_error = !send_AT(AT_SET_CLASS, std::string(1, static_cast<char>(m_config.device_class)));
            break;

        case 7:
            // Set data rate
            at_error = !send_AT(AT_SET_DR, std::to_string(m_config.dr));
            break;

        case 8:
            // Set ADR
            at_error = !send_AT(AT_SET_ADR, std::to_string(m_config.adr));
            break;

        case 9:
            // Set TX power
            at_error = !send_AT(AT_SET_TXP, std::to_string(m_config.txp));
            break;

        case 10:
            // Set confirmed/unconfirmed mode
            at_error = !send_AT(AT_SET_CFM, std::to_string(m_config.cfm));
            break;

        case 11:
            // Set retry count (only relevant if CFM=1)
            if (m_config.cfm) {
                at_error = !send_AT(AT_SET_RETY, std::to_string(LoRa::DEFAULT_RETY));
            }
            break;

        case 12:
            // Apply user-configured low-power mode (LORA_LP_MODE / LRP15):
            //   0 = shutdown (0 µA idle, ~2.5 s reboot on next TX)
            //   1 = standby Stop2 (~1.7 µA idle, ~10 ms wake)
            at_error = !send_AT(AT_SET_LPM, std::to_string(m_config.lp_mode));
            break;

        case 13:
            // Duty Cycle Setting — compile-time flag LORA_DCS_ENABLE.
            //   1 (default) : RAK3172 enforces EU868 1%/0.1%/10% limits (ETSI legal)
            //   0           : DCS off — test builds only, **illegal in EU deployment**
            // We always set this explicitly so the module does not keep a stale
            // value written by an earlier firmware flash.
            at_error = !send_AT(AT_SET_DCS, std::to_string(LORA_DCS_ENABLE));
            break;

        case 14:
            // Full config done — mark configured, jump to common path
            m_is_configured = true;
            m_config_step = 99;  // Will be incremented to 100
            break;

        // ==== Common path (runs every boot) ====

        case 100:
            // Read Device EUI from module and save to config store
            at_error = !send_AT(AT_GET_DEVEUI);
            if (!at_error) {
                m_config.deveui = m_lora_comm.m_last_value;
                DEBUG_INFO("LoRaDevice: DEVEUI=%s", m_config.deveui.c_str());
                configuration_store->write_param(ParamID::LORA_DEVEUI, m_config.deveui);
            }
            break;

        case 101:
            // Check join status / initiate join
            if (m_config.njm == 0) {
                DEBUG_INFO("LoRaDevice: ABP mode - no join required");
                m_joined = true;
                LORA_STATE_CHANGE(configure, idle);
                return;
            }
            at_error = !send_AT(AT_GET_NJS);
            if (!at_error && m_lora_comm.m_last_value == "1") {
                DEBUG_INFO("LoRaDevice: already joined from previous session");
                m_joined = true;
                LORA_STATE_CHANGE(configure, idle);
                return;
            }
            LORA_STATE_CHANGE(configure, joining);
            return;

        default:
            LORA_STATE_CHANGE(configure, error);
            return;
    }

    if (at_error)
    {
        DEBUG_ERROR("LoRaDevice::state_configure: failed at step %u (fatal — no internal retry)", m_config_step);
        // Configure failures (bad credentials, module rejecting AT command) do
        // NOT self-heal on retry. Skip the state_error retry loop, notify the
        // service layer immediately, and cut power. The service's global error
        // counter (DEVICE_ERROR_MAX_CONSECUTIVE) is the single source of truth
        // for when to give up.
        m_consecutive_errors = 0;
        notify(KineisEventDeviceError({}));
        LORA_STATE_CHANGE(configure, power_off);
        return;
    }

    m_config_step++;
    run_state_machine(50);  // Continue configuration
}

void LoRaDevice::state_configure_exit() {
    ;
}

// ========================================================================
// State: joining
//   - Initiate LoRaWAN join procedure
//   - Wait for +EVT:JOINED or +EVT:JOIN FAILED
//   - Timeout after 90 seconds
// ========================================================================

void LoRaDevice::state_joining_enter()
{
    DEBUG_INFO("LoRaDevice::state_joining_enter: NJM=%u", m_config.njm);

    // ABP mode should never reach here, but handle gracefully
    if (m_config.njm == 0) {
        DEBUG_INFO("LoRaDevice: ABP mode - skipping join");
        m_joined = true;
        return;
    }

    m_joined = false;
    m_join_failed = false;
    m_is_error = false;

    // AT+JOIN=<start>:<auto_join>:<interval>:<attempts>
    // start=1, auto_join=0, interval=10s, attempts=8
    // - auto_join=0: no persistent rejoin on failure (saves battery)
    // - attempts=8: ~80s max join window, suitable for surfacing duration
    if (!send_AT(AT_JOIN, "1:0:10:8")) {
        DEBUG_ERROR("LoRaDevice: AT+JOIN command failed");
        m_is_error = true;
        return;
    }

    // Timeout for join procedure (90 seconds = 8 attempts * 10s + margin)
    initiate_timeout(90000);
}

void LoRaDevice::state_joining()
{
    m_lora_comm.process_rx();  // Process any ISR-buffered async events

    if (m_joined)
    {
        DEBUG_INFO("LoRaDevice: network joined successfully");
        LORA_STATE_CHANGE(joining, idle);
    }
    else if (m_join_failed || m_is_error)
    {
        DEBUG_ERROR("LoRaDevice: join failed");
        LORA_STATE_CHANGE(joining, error);
    }
    else
    {
        // Still waiting for join event
        run_state_machine(500);
    }
}

void LoRaDevice::state_joining_exit()
{
    cancel_timeout();
}

// ========================================================================
// State: idle
//   - Check for pending TX packets
//   - Power off if nothing to send
// ========================================================================

void LoRaDevice::state_idle_enter() {
    ;
}

void LoRaDevice::state_idle()
{
    if (m_packet_buffer.length()) {
        LORA_STATE_CHANGE(idle, transmit);
    } else if (m_config.lp_mode == 1) {
        // Standby: module stays powered, LPM Stop2 ~1.7µA, wake ~10ms
        LORA_STATE_CHANGE(idle, standby);
    } else {
        // Shutdown: full power off = 0µA, but 2.5s reboot on next TX
        LORA_STATE_CHANGE(idle, power_off);
    }
}

void LoRaDevice::state_idle_exit() {
    ;
}

// ========================================================================
// State: standby
//   - Module powered, UART initialized, LPM Stop2 active (~1.7µA)
//   - RAK3172 auto-sleeps via LPM=1 when no UART activity
//   - Wake on UART RX (any byte wakes the MCU from Stop2 in ~15µs)
//   - Waiting for send() to be called
// ========================================================================

void LoRaDevice::state_standby_enter() {
    // Deinitialize the nRF UARTE1 peripheral while the RAK3172 sleeps in
    // its own Stop2 LPM. Without this, UARTE1 stays clocked and burns
    // ~300-500 µA even when idle — that's the difference between the
    // LoRa board measuring 0.7 mA vs SMD measuring 27 µA.
    //
    // The RAK3172 itself continues to receive power via SAT_PWR_EN so it
    // retains LoRaWAN session state. We only detach the nRF-side UART;
    // the module's internal Stop2 wake-on-UART is still active on its
    // side, but we no longer clock our peripheral while waiting for a
    // send() call from the service layer.
    DEBUG_INFO("LoRaDevice: standby (RAK Stop2 ~1.7uA + UARTE1 deinit)");
    m_lora_comm.deinit();
    // Re-assert the unused-pin park — defensive in case some other code path
    // reconfigured them between power_on and here.
    lora_park_unused_sat_pins();
}

void LoRaDevice::state_standby() {
    // Nothing to do - module is sleeping, waiting for send() call
}

void LoRaDevice::state_standby_exit() {
    // Re-initialize UARTE1 so we can talk to the RAK3172 again. This is
    // the mirror of state_standby_enter's deinit. The module is still
    // powered (SAT_PWR_EN high), so the first UART byte we send (typically
    // an AT ping from start_device's wake path, or the AT+SEND from
    // state_transmit_enter) will wake it from Stop2 in ~15 µs.
    DEBUG_TRACE("LoRaDevice: standby exit — reinit UART");
    m_lora_comm.init();
}

// ========================================================================
// State: transmit
//   - Send hex payload via AT+SEND=<fport>:<hex_data>
//   - Wait for +EVT:TX_DONE
// ========================================================================

void LoRaDevice::state_transmit_enter()
{
    DEBUG_INFO("LoRaDevice::state_transmit_enter");

    m_tx_done = false;
    m_is_error = false;

    // Format: AT+SEND=<port>:<hex_payload>
    std::string send_params = std::to_string(m_config.fport) + ":" + m_packet_buffer;
    if (!send_AT(AT_SEND, send_params)) {
        DEBUG_ERROR("LoRaDevice: AT+SEND command failed");
        m_is_error = true;
        return;
    }

