spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    notify(KineisEventTxStarted({}));

    // TX timeout based on data rate — low DRs have very long air times
    // EU868 worst case: DR0 (SF12/125kHz) ~2.5s per byte, 51 bytes max = ~130s
    // Add margin for RX windows (1s + 2s) and processing
    static constexpr unsigned int tx_timeout_ms[] = {
        150000,  // DR0 (SF12) — ~130s air time + RX windows
        80000,   // DR1 (SF11) — ~65s air time
        45000,   // DR2 (SF10) — ~35s air time
        25000,   // DR3 (SF9)  — ~18s air time
        15000,   // DR4 (SF8)  — ~10s air time
        10000,   // DR5 (SF7)  — ~5s air time
    };
    unsigned int dr = m_config.dr;
    unsigned int timeout = (dr < 6) ? tx_timeout_ms[dr] : 10000;
    initiate_timeout(timeout);
}

void LoRaDevice::state_transmit()
{
    m_lora_comm.process_rx();  // Process any ISR-buffered async events

    if (m_tx_done)
    {
        m_tx_done = false;
        m_consecutive_errors = 0;  // Reset error counter on successful TX
        DEBUG_TRACE("LoRaDevice::state_transmit: TX complete");
        m_packet_buffer.clear();
        notify(KineisEventTxComplete({}));
        LORA_STATE_CHANGE(transmit, idle);
    }
    else if (m_is_error)
    {
        DEBUG_ERROR("LoRaDevice::state_transmit: TX error");
        LORA_STATE_CHANGE(transmit, error);
    }
    else
    {
        run_state_machine(100);
    }
}

void LoRaDevice::state_transmit_exit()
{
    cancel_timeout();
}

// ========================================================================
// State: error
// ========================================================================

void LoRaDevice::state_error_enter() {
    ;
}

void LoRaDevice::state_error()
{
    m_consecutive_errors++;
    if (m_consecutive_errors <= MAX_CONSECUTIVE_ERRORS) {
        // Transient error — retry from idle (module may still be responsive)
        DEBUG_WARN("LoRaDevice::state_error: retry %u/%u", m_consecutive_errors, MAX_CONSECUTIVE_ERRORS);
        m_is_error = false;
        LORA_STATE_CHANGE(error, idle);
    } else {
        // Persistent error — power cycle
        DEBUG_ERROR("LoRaDevice::state_error: max retries reached, powering off");
        m_consecutive_errors = 0;
        notify(KineisEventDeviceError({}));
        LORA_STATE_CHANGE(error, power_off);
    }
}

void LoRaDevice::state_error_exit() {
    ;
}

// ========================================================================
// Config store integration
// ========================================================================

/// @brief Load LoRaWAN configuration from ConfigStore.
void LoRaDevice::load_config_from_store()
{
    m_config.deveui  = configuration_store->read_param<std::string>(ParamID::LORA_DEVEUI);
    m_config.appeui  = configuration_store->read_param<std::string>(ParamID::LORA_APPEUI);
    m_config.appkey  = configuration_store->read_param<std::string>(ParamID::LORA_APPKEY);
    m_config.devaddr = configuration_store->read_param<std::string>(ParamID::LORA_DEVADDR);
    m_config.appskey = configuration_store->read_param<std::string>(ParamID::LORA_APPSKEY);
    m_config.nwkskey = configuration_store->read_param<std::string>(ParamID::LORA_NWKSKEY);
    m_config.njm     = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_NJM));
    m_config.band    = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_BAND));
    m_config.dr      = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_DR));
    m_config.adr     = configuration_store->read_param<bool>(ParamID::LORA_ADR) ? 1 : 0;
    m_config.txp     = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_TXP));
    m_config.cfm     = configuration_store->read_param<bool>(ParamID::LORA_CFM) ? 1 : 0;
    m_config.fport   = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_FPORT));
    m_config.lp_mode = static_cast<uint8_t>(configuration_store->read_param<unsigned int>(ParamID::LORA_LP_MODE));

    // Class: stored as 0/1/2 → convert to 'A'/'B'/'C'
    unsigned int lora_class = configuration_store->read_param<unsigned int>(ParamID::LORA_CLASS);
    m_config.device_class = 'A' + static_cast<uint8_t>(lora_class);

    // Compute the largest packet the current config will ever produce, and bump
    // LORA_DR to the minimum rate that guarantees it fits. This replaces the
    // previous "silent skip" behavior: every packet the service emits is now
    // transmittable. Only applies to packet types actually enabled by config.
    //
    // EU868 max MAC payload: DR0-2 = 51 B, DR3 = 115 B, DR4-5 = 222 B.
    unsigned int max_packet_bytes = 2;  // Status packet floor (14 bits)

    // CloudLocate MEAS50 is only emitted when FASTLOC_MODE=CLOUDLOCATE + fmt=MEAS50
    unsigned int fastloc_mode = configuration_store->read_param<unsigned int>(ParamID::GNSS_FASTLOC_MODE);
    unsigned int cl_format    = configuration_store->read_param<unsigned int>(ParamID::GNSS_CLOUDLOCATE_FORMAT);
    if (fastloc_mode == (unsigned int)BaseFastlocMode::CLOUDLOCATE &&
        cl_format    == (unsigned int)BaseCloudLocateFormat::MEAS50) {
        // type(3)+fmt(2)+flags(4)+volt(7)+50B = 16+400 = 416 bits = 52 B
        if (52 > max_packet_bytes) max_packet_bytes = 52;
    }

    // Sensor packet: header + mask + always-present GPS_FULL + enabled sensors
    unsigned int sensor_bits = 14 + 6 + 86;  // header + mask + GPS_FULL
    if (fastloc_mode >= (unsigned int)BaseFastlocMode::DEGRADED_PVT)
        sensor_bits += 60;                   // BITS_FASTLOC_QUALITY
#if ENABLE_ALS_SENSOR
    if (configuration_store->read_param<bool>(ParamID::ALS_SENSOR_ENABLE))
        sensor_bits += 17;
#endif
#if ENABLE_PH_SENSOR
    if (configuration_store->read_param<bool>(ParamID::PH_SENSOR_ENABLE))
        sensor_bits += 14;
#endif
#if ENABLE_PRESSURE_SENSOR
    if (configuration_store->read_param<bool>(ParamID::PRESSURE_SENSOR_ENABLE))
        sensor_bits += 29;                   // pressure + press_temp
#endif
    // SEA_TEMP and THERMISTOR share the same 14-bit slot (mutually exclusive at build)
#if ENABLE_SEA_TEMP_SENSOR
    if (configuration_store->read_param<bool>(ParamID::SEA_TEMP_SENSOR_ENABLE))
        sensor_bits += 14;
#endif
#if ENABLE_THERMISTOR_SENSOR
    if (configuration_store->read_param<bool>(ParamID::THERMISTOR_SENSOR_ENABLE))
        sensor_bits += 14;
#endif
#if ENABLE_AXL_SENSOR
    if (configuration_store->read_param<bool>(ParamID::AXL_SENSOR_ENABLE))
        sensor_bits += 67;                   // AXL temp + 3 axis + act
#endif
    unsigned int sensor_bytes = (sensor_bits + 7) / 8;
    if (sensor_bytes > max_packet_bytes) max_packet_bytes = sensor_bytes;

