spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    // GPS multi is always size-clamped by max_gps_entries(), so it never
    // exceeds the current DR — no contribution to max_packet_bytes.

    // Map byte threshold → min required DR
    uint8_t min_dr = 0;
    if      (max_packet_bytes > 115) min_dr = 4;  // DR4 (222 B)
    else if (max_packet_bytes > 51)  min_dr = 3;  // DR3 (115 B)
    else                             min_dr = 0;  // any DR

    if (m_config.dr < min_dr) {
        DEBUG_WARN("LoRaDevice: max packet %u B requires DR≥%u — bumping LORA_DR %u → %u",
                   max_packet_bytes, min_dr, m_config.dr, min_dr);
        m_config.dr = min_dr;
    }

    DEBUG_INFO("LoRaDevice: config NJM=%u BAND=%u DR=%u ADR=%u TXP=%u CFM=%u FPORT=%u CLASS=%c LP=%u",
               m_config.njm, m_config.band, m_config.dr, m_config.adr,
               m_config.txp, m_config.cfm, m_config.fport, m_config.device_class, m_config.lp_mode);
    if (!m_config.deveui.empty())
        DEBUG_INFO("LoRaDevice: DEVEUI=%s", m_config.deveui.c_str());
    if (!m_config.appeui.empty())
        DEBUG_INFO("LoRaDevice: APPEUI=%s", m_config.appeui.c_str());
}

/// @brief Read LoRa credentials from RAK3172 module via AT commands.
/// Module must be powered on (idle/standby/configure state).
LoRaDevice::LoRaCredentials LoRaDevice::read_lora_credentials()
{
    LoRaCredentials creds;
    creds.read_ok = false;

    // Auto-wake: if the module is off (LORA_LP_MODE=0 shutdown, or
    // LORA_POWER_OFF_UNDERWATER during a dive), boot it up just for this read.
    // Restore to power_off on exit so the caller's idle state is preserved.
    bool was_off = (m_state == State::power_off);
    if (!ensure_module_awake()) {
        DEBUG_ERROR("LoRaDevice::read_lora_credentials: module wake-up failed");
        return creds;
    }

    // Read NJM — defensive parse: only accept "0" or "1", anything else is
    // likely leftover banner/noise that slipped past the comm filter.
    if (send_AT(AT_GET_NJM)) {
        const std::string& v = m_lora_comm.m_last_value;
        if (v == "0") creds.njm = 0;
        else if (v == "1") creds.njm = 1;
        else {
            DEBUG_WARN("LoRaDevice::read_lora_credentials: unexpected NJM value '%s' — treating as read failure", v.c_str());
            if (was_off) power_off_immediate();
            return creds;
        }
    } else {
        DEBUG_WARN("LoRaDevice::read_lora_credentials: failed to read NJM");
        if (was_off) power_off_immediate();
        return creds;
    }

    // Read DEVEUI
    if (send_AT(AT_GET_DEVEUI)) {
        creds.deveui = m_lora_comm.m_last_value;
    }

    if (creds.njm == 1) {
        // OTAA: read APPEUI + APPKEY
        if (send_AT(AT_GET_APPEUI)) {
            creds.appeui = m_lora_comm.m_last_value;
        }
        if (send_AT(AT_GET_APPKEY)) {
            creds.appkey = m_lora_comm.m_last_value;
        }
    } else {
        // ABP: read DEVADDR (NWKSKEY/APPSKEY are write-only on RAK3172)
        if (send_AT(AT_GET_DEVADDR)) {
            creds.devaddr = m_lora_comm.m_last_value;
        }
    }

    creds.read_ok = true;

    if (was_off) {
        DEBUG_TRACE("LoRaDevice::read_lora_credentials: restoring power-off");
        power_off_immediate();
    }
    return creds;
}

/// @brief Write LoRa credentials from the config store to the RAK3172 module.
/// Module must be powered on (idle/standby/configure state). Caller must reload
/// the module config (e.g. via read_lora_credentials()) afterwards to refresh cache.
/// @note Changing NJM triggers a RAK3172 reboot; subsequent AT writes in the same
///       call will fail. Callers should only change NJM outside this path or
///       re-invoke after the reboot completes.
bool LoRaDevice::write_credentials_from_config()
{
    bool was_off = (m_state == State::power_off);
    if (!ensure_module_awake()) {
        DEBUG_ERROR("LoRaDevice::write_credentials_from_config: wake-up failed");
        return false;
    }

    // Load latest values from config store into m_config (keeps local cache coherent)
    load_config_from_store();
    DEBUG_INFO("write_credentials: njm=%u deveui='%s' (len=%u) devaddr='%s' (len=%u) "
               "appeui_len=%u appkey_len=%u nwkskey_len=%u appskey_len=%u",
               m_config.njm,
               m_config.deveui.c_str(),  static_cast<unsigned>(m_config.deveui.size()),
               m_config.devaddr.c_str(), static_cast<unsigned>(m_config.devaddr.size()),
               static_cast<unsigned>(m_config.appeui.size()),
               static_cast<unsigned>(m_config.appkey.size()),
               static_cast<unsigned>(m_config.nwkskey.size()),
               static_cast<unsigned>(m_config.appskey.size()));

    // Set join mode first — module may reboot if NJM changes
    DEBUG_TRACE("write_credentials: step NJM");
    if (!send_AT(AT_SET_NJM, std::to_string(m_config.njm))) {
        DEBUG_ERROR("write_credentials: AT_SET_NJM failed");
        return false;
    }

    // DEVEUI: OTAA only. ABP activation uses DEVADDR + session keys; writing
    // DEVEUI in ABP triggers RAK3172 PARAM_ERROR type=2 in some states.
    if (m_config.njm == 1 &&
        !m_config.deveui.empty() && m_config.deveui != "0000000000000000") {
        if (m_config.deveui.size() != 16) {
            DEBUG_ERROR("write_credentials: invalid DEVEUI length %u",
                        static_cast<unsigned>(m_config.deveui.size()));
            return false;
        }
        DEBUG_TRACE("write_credentials: step DEVEUI");
        if (!send_AT(AT_SET_DEVEUI, m_config.deveui)) {
            DEBUG_ERROR("write_credentials: AT_SET_DEVEUI failed");
            return false;
        }
    } else if (m_config.njm == 0) {
        DEBUG_TRACE("write_credentials: ABP mode — skipping DEVEUI");
    }

    if (m_config.njm == 1) {
        // OTAA: APPEUI + APPKEY
        if (!m_config.appeui.empty()) {
            if (m_config.appeui.size() != 16) {
                DEBUG_ERROR("write_credentials: invalid APPEUI length %u",
                            static_cast<unsigned>(m_config.appeui.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step APPEUI");
            if (!send_AT(AT_SET_APPEUI, m_config.appeui)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPEUI failed");
                return false;
            }
        }
        if (!m_config.appkey.empty()) {
            if (m_config.appkey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid APPKEY length %u",
                            static_cast<unsigned>(m_config.appkey.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step APPKEY");
            if (!send_AT(AT_SET_APPKEY, m_config.appkey)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPKEY failed");
                return false;
            }
        }
    } else {
        // ABP: DEVADDR + NWKSKEY + APPSKEY all required for a functional session.
        // (Previously only DEVADDR was written — session keys were skipped with a
        // misleading "write-only" comment. They ARE write-only at the RAK3172 read
        // side but MUST be written for ABP activation.)
        if (!m_config.devaddr.empty()) {
            if (m_config.devaddr.size() != 8) {
                DEBUG_ERROR("write_credentials: invalid DEVADDR length %u",
                            static_cast<unsigned>(m_config.devaddr.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step DEVADDR");
            if (!send_AT(AT_SET_DEVADDR, m_config.devaddr)) {
                DEBUG_ERROR("write_credentials: AT_SET_DEVADDR failed");
                return false;
            }
        }
        if (!m_config.nwkskey.empty()) {
            if (m_config.nwkskey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid NWKSKEY length %u",
                            static_cast<unsigned>(m_config.nwkskey.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step NWKSKEY");
            if (!send_AT(AT_SET_NWKSKEY, m_config.nwkskey)) {
                DEBUG_ERROR("write_credentials: AT_SET_NWKSKEY failed");
                return false;
            }
        }
        if (!m_config.appskey.empty()) {
            if (m_config.appskey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid APPSKEY length %u",
                            static_cast<unsigned>(m_config.appskey.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step APPSKEY");
            if (!send_AT(AT_SET_APPSKEY, m_config.appskey)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPSKEY failed");
                return false;
            }
        }
    }

