spoemb/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    DEBUG_INFO("write_credentials: credentials written OK (njm=%u)", m_config.njm);
    if (was_off) {
        DEBUG_TRACE("LoRaDevice::write_credentials_from_config: restoring power-off");
        power_off_immediate();
    }
    return true;
}

/// @brief Start RF Continuous Wave on the RAK3172 (AT+CW=freq,pwr,duration).
/// Auto-wakes if needed — CW is a test command so we do NOT restore power-off
/// afterwards: the CW itself takes over the radio for its `duration_s` window,
/// and the caller typically pairs with cw_stop (ATZ) which brings the driver
/// back to power_off anyway.
bool LoRaDevice::cw_start(uint32_t freq_hz, uint16_t power_dbm, uint16_t duration_s)
{
    if (!ensure_module_awake()) {
        DEBUG_WARN("LoRaDevice::cw_start: module wake-up failed");
        return false;
    }
    if (duration_s == 0) duration_s = 60;   // RUI3 requires a duration
    std::string params = std::to_string(freq_hz) + "," +
                         std::to_string(power_dbm) + "," +
                         std::to_string(duration_s);
    DEBUG_INFO("LoRaDevice::cw_start: %s", params.c_str());
    return send_AT(AT_SET_CW, params);
}

/// @brief Stop CW — RUI3 does not expose AT+CW stop; issue ATZ. The module
/// resets without sending "OK", so we dispatch the write without waiting and
/// force our own state machine back to power_off. The next send() will bring
/// the module up cleanly via the normal configure path.
bool LoRaDevice::cw_stop()
{
    DEBUG_INFO("LoRaDevice::cw_stop (ATZ reset)");
    if (m_state == State::power_off) return true;  // Already stopped

    // If the driver is in standby, UARTE1 is deinit'd (see state_standby_enter).
    // Sending AT_RESET on an unclocked UART would bus-fault. Re-init first.
    if (m_state == State::standby) {
        m_lora_comm.init();
    }

    // Fire-and-forget: RUI3 silently resets on ATZ, so waiting for OK would
    // always time out and falsely report failure.
    m_lora_comm.send(AT_RESET);
    PMU::delay_ms(10);  // Let the bytes drain to UART before we tear down the state machine.

    // Match internal state to the fact that the module is rebooting.
    power_off_immediate();
    return true;
}

/// @brief Synchronous wake-up helper — auto power-on + wait for AT readiness.
/// Does NOT block on configure/join so DTE callers (SATVF, get_firmware_version,
/// COMCW) get a fast turnaround. Returns as soon as AT_TEST succeeds.
bool LoRaDevice::ensure_module_awake(unsigned int timeout_ms)
{
    if (m_state == State::standby) {
        // Module is in RAK3172 Stop2 LPM and — importantly — our nRF UARTE1
        // was deinit'd by state_standby_enter for power savings. Sending on
        // an unclocked UARTE peripheral causes a bus fault (HARDFAULT / MCU
        // reboot). Re-init the UART and send an AT ping to wake the module.
        DEBUG_INFO("LoRaDevice::ensure_module_awake: module standby — reinit UART + wake ping");
        m_lora_comm.init();
        bool wake_ok = false;
        for (int attempt = 0; attempt < 3 && !wake_ok; attempt++) {
            if (send_AT(AT_TEST, std::nullopt, 500))
                wake_ok = true;
        }
        if (wake_ok) {
            m_state = State::idle;
            return true;
        }
        // Wake failed — fall through to power cycle path below.
        DEBUG_WARN("LoRaDevice::ensure_module_awake: standby wake failed — power cycling");
        power_off_immediate();
        // continue into the power_off branch
    }

    if (m_state != State::power_off) {
        return true;  // Already powered (idle, configure, joining, transmit)
    }

    DEBUG_INFO("LoRaDevice::ensure_module_awake: module off — booting");

    // Kick off the state machine (power_off → power_on). The async state machine
    // will run configure + join in the background after we return.
    GPIOPins::set(SAT_PWR_EN);
    GPIOPins::set(SAT_EXTWAKEUP);
    m_lora_comm.init();
    m_lora_comm.subscribe(*this);

    // Wait for the RAK3172 boot banner to settle (~1.5 s typical) and drain it.
    const unsigned int boot_delay_ms = 2000;
    for (unsigned int i = 0; i < boot_delay_ms && timeout_ms > boot_delay_ms; i += 50) {
        PMU::delay_ms(50);
    }
    if (timeout_ms <= boot_delay_ms) {
        DEBUG_WARN("LoRaDevice::ensure_module_awake: timeout < boot delay, skipping wait");
    } else {
        timeout_ms -= boot_delay_ms;
    }
    m_lora_comm.process_rx();  // drain boot banner

    // Probe the module with AT. First ping after cold boot sometimes needs retry.
    while (timeout_ms > 0) {
        if (send_AT(AT_TEST, std::nullopt, 500)) {
            // Transition the driver state to idle so the normal FSM path resumes.
            // configure/join will run asynchronously on the next scheduler tick.
            DEBUG_INFO("LoRaDevice::ensure_module_awake: module responded in < %ums", 3500 - timeout_ms);
            m_state = State::idle;
            run_state_machine(50);
            return true;
        }
        if (timeout_ms < 500) break;
        timeout_ms -= 500;
    }

    DEBUG_ERROR("LoRaDevice::ensure_module_awake: module did not respond to AT within timeout");
    return false;
}

/// @brief Read RAK3172 RUI3 firmware version. Auto-wakes if needed, restores
/// the initial power state (off) on exit so idle power draw is unchanged by
/// DTE queries. Retries once if the first response looks like lingering boot
/// banner text instead of a version string.
std::string LoRaDevice::get_firmware_version()
{
    bool was_off = (m_state == State::power_off);
    if (!ensure_module_awake()) {
        DEBUG_WARN("LoRaDevice::get_firmware_version: module wake-up failed");
        return "";
    }

    // Valid RUI3 version strings start with "RUI_" (e.g. "RUI_4.0.6_RAK3272-SiP").
    // If the first response is anything else (typically leftover boot banner),
    // drain RX and retry once — the comm filter may have missed a late banner.
    std::string version;
    for (int attempt = 0; attempt < 2; attempt++) {
        if (!send_AT(AT_GET_VER)) {
            DEBUG_WARN("LoRaDevice::get_firmware_version: AT+VER=? failed (attempt %d)", attempt + 1);
            break;
        }
        const std::string& v = m_lora_comm.m_last_value;
        if (v.compare(0, 4, "RUI_") == 0 || v.compare(0, 4, "RAK") == 0) {
            version = v;
            break;
        }
        DEBUG_WARN("LoRaDevice::get_firmware_version: unexpected response '%s', draining and retrying", v.c_str());
        PMU::delay_ms(200);
        m_lora_comm.process_rx();
    }

    if (was_off) {
        DEBUG_TRACE("LoRaDevice::get_firmware_version: restoring power-off");
        power_off_immediate();
    }
    return version;
}

// ========================================================================
// KineisDevice interface - unused methods for LoRa
// ========================================================================

void LoRaDevice::start_receive(const KineisModulation mode)
{
    (void)mode;
    DEBUG_WARN("LoRaDevice::start_receive: not implemented (use Class C for continuous RX)");
}

bool LoRaDevice::stop_receive()
{
    DEBUG_WARN("LoRaDevice::stop_receive: not implemented");
    return false;
}

void LoRaDevice::set_frequency(double freq_mhz)
{
    (void)freq_mhz;
    DEBUG_TRACE("LoRaDevice::set_frequency: %.3f MHz (ignored - LoRa uses band/channel config)", freq_mhz);
}

void LoRaDevice::set_tcxo_warmup_time(unsigned int ms)
{
    (void)ms;
    DEBUG_TRACE("LoRaDevice::set_tcxo_warmup_time: %u ms (managed by RAK3172)", ms);
}
